<?php

return array(
	
	/*
    |--------------------------------------------------------------------------
    | Messages Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used by the messages
    |
    | 信息提示码列表，用户提示信息的，不唯一，可以重复使用
    | 从10001到20000为提示信息
    |
    */

    10001   =>  "店铺增加成功",
    10002   =>  "店铺删除成功",
    10003   =>  "店铺基本信息修改成功",
    10004   =>  "店铺营业规则修改成功",
    10005   =>  "店铺营业信息修改成功",
    10006   =>  "该账号目前没有店铺或店铺未审核通过，请进入店铺管理查看",
    10007   =>  "菜品增加成功",
    10008   =>  "店铺营业状态修改成功",
    10009   =>  "无店铺可切换",
    10010   =>  "菜品信息修改成功",
    10011   =>  "菜品删除成功",
    10012   =>  "菜品状态修改成功",
    10013   =>  "订单状态修改成功",
    10014   =>  "您的所有店铺暂时还没有审核通过，请耐心等待",
    10015   =>  "暂不支持全部店铺，请切换为单个店铺",
    10016   =>  "注册成功",
    10017   =>  "密码重置成功",
    10018   =>  "您已经成功报名",
    10019   =>  "您已经成功取消",
    10020   =>  "密码修改成功，请重新登陆",
    10021   =>  "基本信息修改成功",
    10022   =>  "修改已验证手机成功",
);